lisp/sicp/sicp-4.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Metalinguistic Abstraction</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Metalinguistic Abstraction</h1>
<p>
Previous: <a href="sicp-3.html">3. Modularity, Objects, and State</a>
</p>

<p>
Next: <a href="sicp-5.html">5. Computing with Register Machines</a>
</p>

<p>
An evaluator written in the same language that it evaluates is said
to be <i>metacircular</i>. Recall that in our <i>environment model of 
evaluation</i>, the body of a procedure is evaluated in a new environment,
which is constructed by extending the environment part of the procedure
object by a frame in which the formal parameters of the procedure
are bound to the arguments to which the procedure is applied.
</p>

<p>
Thus, the basic process of evaluation is to evaluate expressions in
environments by reducing them to procedures to be applied to arguments,
which in turn reduce to new expressions to be evaluated in new environments,
until we get down to symbols, whose values are looked up in the environment
and to primitive procedures, which are applied directly.
</p>

<div id="outline-container-orgd97131a" class="outline-2">
<h2 id="orgd97131a">Core of the Evaluator</h2>
<div class="outline-text-2" id="text-orgd97131a">
<p>
<code>EVAL</code> takes two arguments, an expression and an environment. It is a
structured case analysis of the syntatic type of the expression to be
evaluated. Thus, each type of expression has a predicate that tests for it
and an abstract means for selecting its parts. This <i>abstract syntax</i>
makes it easier to change the syntax of the language used by the same
evaluator, but with a different collection of syntax procedures.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defpackage</span> <span style="color: #228b22;">:sicp</span>
  (<span style="color: #483d8b;">:use</span> <span style="color: #483d8b;">:cl</span>))

(<span style="color: #a020f0;">in-package</span> <span style="color: #483d8b;">:sicp</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">eval</span> ()
  (print <span style="color: #8b2252;">"hello world"</span>))

</pre>
</div>

<pre class="example">
CS325-USER::EVAL*
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 31 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
